Autodesk.Revit.DB.WorksetVisibility
Indicates the visibility settings of a workset in a particular view.
Since:
2012

Autodesk.Revit.DB.WorksetVisibility.UseGlobalSetting
Do not override the visibility.

Autodesk.Revit.DB.WorksetVisibility.Hidden
Be hidden in a view.

Autodesk.Revit.DB.WorksetVisibility.Visible
Be visible in a view (i.e. will be visible unless it is closed).